MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M4521LE6AE/mcu.h
#define CAN_IF_DAT_B1_DATA4_Pos    0                                    /*!< CAN_IF_T::DATAB1: DATA4 Position */
#define CAN_IF_DAT_B1_DATA4_Msk    (0xFFul << CAN_IF_DAT_B1_DATA4_Pos)  /*!< CAN_IF_T::DATAB1: DATA4 Mask */

/* CAN IFn_DATA_B2 Bit Field Definitions */                                     
#define CAN_IF_DAT_B2_DATA7_Pos    8                                    /*!< CAN_IF_T::DATAB2: DATA7 Position */
#define CAN_IF_DAT_B2_DATA7_Msk    (0xFFul << CAN_IF_DAT_B2_DATA7_Pos)  /*!< CAN_IF_T::DATAB2: DATA7 Mask     */

#define CAN_IF_DAT_B2_DATA6_Pos    0                                    /*!< CAN_IF_T::DATAB2: DATA6 Position */
#define CAN_IF_DAT_B2_DATA6_Msk    (0xFFul << CAN_IF_DAT_B2_DATA6_Pos)  /*!< CAN_IF_T::DATAB2: DATA6 Mask     */

/* CAN IFn_TXRQST1 Bit Field Definitions */
#define CAN_TXRQST1_TXRQST_Pos  0                                        /*!< CAN_T::TXRQST1: TXRQST Position */
#define CAN_TXRQST1_TXRQST_Msk  (0xFFFFul << CAN_TXRQST1_TXRQST_Pos)  /*!< CAN_T::TXRQST1: TXRQST Mask     */

/* CAN IFn_TXRQST2 Bit Field Definitions */                                         
#define CAN_TXRQST2_TXRQST_Pos  0                                        /*!< CAN_T::TXRQST2: TXRQST Position  */
#define CAN_TXRQST2_TXRQST_Msk  (0xFFFFul << CAN_TXRQST2_TXRQST_Pos)  /*!< CAN_T::TXRQST2: TXRQST Mask      */

/* CAN IFn_NDAT1 Bit Field Definitions */                                           
#define CAN_NDAT1_NEWDATA_Pos   0                                        /*!< CAN_T::NDAT1: NEWDATA Position */
#define CAN_NDAT1_NEWDATA_Msk   (0xFFFFul << CAN_NDAT1_NEWDATA_Pos)   /*!< CAN_T::NDAT1: NEWDATA Mask     */

/* CAN IFn_NDAT2 Bit Field Definitions */                                          
#define CAN_NDAT2_NEWDATA_Pos   0                                        /*!< CAN_T::NDAT2: NEWDATA Position */
#define CAN_NDAT2_NEWDATA_Msk   (0xFFFFul << CAN_NDAT2_NEWDATA_Pos)   /*!< CAN_T::NDAT2: NEWDATA Mask     */

/* CAN IFn_IPND1 Bit Field Definitions */                                          
#define CAN_IPND1_INTPND_Pos   0                                         /*!< CAN_T::IPND1: INTPND Position */
#define CAN_IPND1_INTPND_Msk   (0xFFFFul << CAN_IPND1_INTPND_Pos)     /*!< CAN_T::IPND1: INTPND Mask     */

/* CAN IFn_IPND2 Bit Field Definitions */                                          
#define CAN_IPND2_INTPND_Pos   0                                         /*!< CAN_T::IPND2: INTPND Position */
#define CAN_IPND2_INTPND_Msk   (0xFFFFul << CAN_IPND2_INTPND_Pos)     /*!< CAN_T::IPND2: INTPND Mask     */

/* CAN IFn_MVLD1 Bit Field Definitions */                                          
#define CAN_MVLD1_MSGVAL_Pos   0                                         /*!< CAN_T::MVLD1: MSGVAL Position */
#define CAN_MVLD1_MSGVAL_Msk   (0xFFFFul << CAN_MVLD1_MSGVAL_Pos)     /*!< CAN_T::MVLD1: MSGVAL Mask     */

/* CAN IFn_MVLD2 Bit Field Definitions */                                           
#define CAN_MVLD2_MSGVAL_Pos   0                                         /*!< CAN_T::MVLD2: MSGVAL Position */
#define CAN_MVLD2_MSGVAL_Msk   (0xFFFFul << CAN_MVLD2_MSGVAL_Pos)     /*!< CAN_T::MVLD2: MSGVAL Mask     */

/* CAN WUEN Bit Field Definitions */                                                
#define CAN_WUEN_WAKUP_EN_Pos     0                                         /*!< CAN_T::WU_EN: WAKUP_EN Position */
#define CAN_WUEN_WAKUP_EN_Msk    (0x1ul << CAN_WUEN_WAKUP_EN_Pos)           /*!< CAN_T::WU_EN: WAKUP_EN Mask     */

/* CAN WUSTATUS Bit Field Definitions */
#define CAN_WUSTATUS_WAKUP_STS_Pos     0                                      /*!< CAN_T::WU_STATUS: WAKUP_STS Position */
#define CAN_WUSTATUS_WAKUP_STS_Msk    (0x1ul << CAN_WUSTATUS_WAKUP_STS_Pos)   /*!< CAN_T::WU_STATUS: WAKUP_STS Mask     */


/**@}*/ /* CAN_CONST */
/**@}*/ /* end of CAN register group */


/*---------------------- System Clock Controller -------------------------*/
/**
    @addtogroup CLK System Clock Controller(CLK)
    Memory Mapped Structure for CLK Controller
@{ */


typedef struct
{




/**
 * @var CLK_T::PWRCTL
 * Offset: 0x00  System Power-down Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |HXTEN     |External 4~24 MHz High-Speed Crystal Enable Bit (Write Protect)
 * |        |          |The bit default value is set by flash controller user configuration register CONFIG0 [26:24].
 * |        |          |When the default clock source is from external 4~24 MHz high-speed crystal, this bit is set to 1 automatically.
 * |        |          |0 = External 4 ~ 24 MHz high speed crystal oscillator (HXT) Disabled.
 * |        |          |1 = External 4 MH~ 24 z high speed crystal oscillator (HXT) Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[1]     |LXTEN     |External 32.768 KHz Low-Speed Crystal Enable Bit (Write Protect)
 * |        |          |0 = External 32.768 kHz low-speed crystal oscillator (LXT) Disabled.
 * |        |          |1 = External 32.768 kHz low-speed crystal oscillator (LXT) Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[2]     |HIRCEN    |Internal 22.1184 MHz High-Speed Oscillator Enable Bit (Write Protect)
 * |        |          |0 = Internal 22.1184 MHz high-speed RC oscillator (HIRC) Disabled.
 * |        |          |1 = Internal 22.1184 MHz high-speed RC oscillator (HIRC) Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[3]     |LIRCEN    |Internal 10 KHz Low-Speed Oscillator Enable Bit (Write Protect)
 * |        |          |0 = Internal 10 kHz low speed RC oscillator (LIRC) Disabled.
 * |        |          |1 = Internal 10 kHz low speed RC oscillator (LIRC) Enabled.
 * |[4]     |PDWKDLY   |Enable The Wake-Up Delay Counter (Write Protect)
 * |        |          |When the chip wakes up from Power-down mode, the clock control will delay certain clock cycles to wait system clock stable.
 * |        |          |The delayed clock cycle is 4096 clock cycles when chip work at external 4~24 MHz high-speed crystal, and 256 clock cycles when chip work at internal 22.1184 MHz high-speed oscillator.
 * |        |          |0 = Clock cycles delay Disabled.
 * |        |          |1 = Clock cycles delay Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[5]     |PDWKIEN   |Power-Down Mode Wake-Up Interrupt Enable Bit (Write Protect)
 * |        |          |0 = Power-down Mode Wake-up Interrupt Disabled.
 * |        |          |1 = Power-down Mode Wake-up Interrupt Enabled.
 * |        |          |Note1: The interrupt will occur when both PDWKIF and PDWKIEN are high.
 * |        |          |Note2: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[6]     |PDWKIF    |Power-Down Mode Wake-Up Interrupt Status
 * |        |          |Set by "Power-down wake-up event", it indicates that resume from Power-down mode
 * |        |          |The flag is set if the EINT0~5, GPIO, USBH, USBD, OTG, UART0~3, WDT, CAN0, ACMP01, BOD, RTC, TMR0~3, I2C0~1 or TK wake-up occurred.
 * |        |          |Note1: Write 1 to clear the bit to 0.
 * |        |          |Note2: This bit works only if PDWKIEN (CLK_PWRCTL[5]) set to 1.
 * |[7]     |PDEN      |System Power-Down Enable (Write Protect)
 * |        |          |When this bit is set to 1, Power-down mode is enabled and chip Power-down behavior will depend on the PDWTCPU bit.
 * |        |          |(a) If the PDWTCPU is 0, then the chip enters Power-down mode immediately after the PDEN bit set.(default)
 * |        |          |(b) if the PDWTCPU is 1, then the chip keeps active till the CPU sleep mode is also active and then the chip enters Power-down mode.
 * |        |          |When chip wakes up from Power-down mode, this bit is auto cleared.
 * |        |          |Users need to set this bit again for next Power-down.
 * |        |          |In Power-down mode, external 4~24 MHz high-speed crystal and the internal 22.1184 MHz high-speed oscillator will be disabled in this mode, but the external 32.768 kHz low-speed crystal and internal 10 kHz low-speed oscillator are not controlled by Power-down mode.
 * |        |          |In Power-down mode, the PLL and system clock are disabled, and ignored the clock source selection.
 * |        |          |The clocks of peripheral are not controlled by Power-down mode, if the peripheral clock source is from external 32.768 kHz low-speed crystal or the internal 10 kHz low-speed oscillator.
 * |        |          |0 = Chip operating normally or chip in idle mode because of WFI command.
 * |        |          |1 = Chip enters Power-down mode instant or wait CPU sleep command WFI.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[8]     |PDWTCPU   |This Bit Control The Power-Down Entry Condition (Write Protect)
 * |        |          |0 = Chip enters Power-down mode when the PDEN bit is set to 1.
 * |        |          |1 = Chip enters Power-down mode when the both PDWTCPU and PDEN bits are set to 1 and CPU run WFI instruction.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[11:10] |HXTGAIN   |4~24 MHz High-Speed Crystal Gain Control Bit
 * |        |          |(Write Protect)
 * |        |          |This is a protected register. Please refer to open lock sequence to program it.
 * |        |          |Gain control is used to enlarge the gain of crystal to make sure crystal work normally.
 * |        |          |If gain control is enabled, crystal will consume more power than gain control off.
 * |        |          |00 = HXT frequency is lower than from 8 MHz.
 * |        |          |01 = HXT frequency is from 8 MHz to 12 MHz.
 * |        |          |10 = HXT frequency is from 12 MHz to 16 MHz.
 * |        |          |11 = HXT frequency is higher than 16 MHz.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[12]    |HXTSELTYP |4~24 MHz High-Speed Crystal Type Select Bit (Write Protect)
 * |        |          |This is a protected register. Please refer to open lock sequence to program it.
 * |        |          |0 = Select INV type.
 * |        |          |1 = Select GM type.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * @var CLK_T::AHBCLK
 * Offset: 0x04  AHB Devices Clock Enable Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1]     |PDMACKEN  |PDMA Controller Clock Enable Bit
 * |        |          |0 = PDMA peripheral clock Disabled.
 * |        |          |1 = PDMA peripheral clock Enabled.
 * |[2]     |ISPCKEN   |Flash ISP Controller Clock Enable Bit
 * |        |          |0 = Flash ISP peripheral clock Disabled.
 * |        |          |1 = Flash ISP peripheral clock Enabled.
 * |[3]     |EBICKEN   |EBI Controller Clock Enable Bit
 * |        |          |0 = EBI peripheral clock Disabled.
 * |        |          |1 = EBI peripheral clock Enabled.
 * |[4]     |USBHCKEN  |USB HOST Controller Clock Enable Bit
 * |        |          |0 = USB HOST peripheral clock Disabled.
 * |        |          |1 = USB HOST peripheral clock Enabled.
 * |[7]     |CRCCKEN   |CRC Generator Controller Clock Enable Bit
 * |        |          |0 = CRC peripheral clock Disabled.
 * |        |          |1 = CRC peripheral clock Enabled.
 * |[15]    |FMCIDLE   |Flash Memory Controller Clock Enable Bit In IDLE Mode
 * |        |          |0 = FMC peripheral clock Disabled when chip operating at IDLE mode.
 * |        |          |1 = FMC peripheral clock Enabled when chip operating at IDLE mode.
 * @var CLK_T::APBCLK0
 * Offset: 0x08  APB Devices Clock Enable Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WDTCKEN   |Watchdog Timer Clock Enable Bit (Write Protect)
 * |        |          |0 = Watchdog Timer Clock Disabled.
 * |        |          |1 = Watchdog Timer Clock Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[1]     |RTCCKEN   |Real-Time-Clock APB Interface Clock Enable Bit
 * |        |          |This bit is used to control the RTC APB clock only.
 * |        |          |The RTC peripheral clock source is selected from RTCSEL(CLK_CLKSEL3[8]).
 * |        |          |It can be selected to external 32.768 kHz low speed crystal or internal 10 kHz low speed oscillator.
 * |        |          |0 = RTC Clock Disabled.
 * |        |          |1 = RTC Clock Enabled.
 * |[2]     |TMR0CKEN  |Timer0 Clock Enable Bit
 * |        |          |0 = Timer0 Clock Disabled.
 * |        |          |1 = Timer0 Clock Enabled.
 * |[3]     |TMR1CKEN  |Timer1 Clock Enable Bit
 * |        |          |0 = Timer1 Clock Disabled.
 * |        |          |1 = Timer1 Clock Enabled.
 * |[4]     |TMR2CKEN  |Timer2 Clock Enable Bit
 * |        |          |0 = Timer2 Clock Disabled.
 * |        |          |1 = Timer2 Clock Enabled.
 * |[5]     |TMR3CKEN  |Timer3 Clock Enable Bit
 * |        |          |0 = Timer3 Clock Disabled.
 * |        |          |1 = Timer3 Clock Enabled.
 * |[6]     |CLKOCKEN  |CLKO Clock Enable Bit
 * |        |          |0 = CLKO Clock Disabled.
 * |        |          |1 = CLKO Clock Enabled.
 * |[7]     |ACMP01CKEN|Analog Comparator 0/1 Clock Enable Bit
 * |        |          |0 = Analog Comparator 0/1 Clock Disabled.
 * |        |          |1 = Analog Comparator 0/1 Clock Enabled.
 * |[8]     |I2C0CKEN  |I2C0 Clock Enable Bit
 * |        |          |0 = I2C0 Clock Disabled.
 * |        |          |1 = I2C0 Clock Enabled.
 * |[9]     |I2C1CKEN  |I2C1 Clock Enable Bit
 * |        |          |0 = I2C1 Clock Disabled.
 * |        |          |1 = I2C1 Clock Enabled.
 * |[12]    |SPI0CKEN  |SPI0 Clock Enable Bit
 * |        |          |0 = SPI0 Clock Disabled.
 * |        |          |1 = SPI0 Clock Enabled.
 * |[13]    |SPI1CKEN  |SPI1 Clock Enable Bit
 * |        |          |0 = SPI1 Clock Disabled.
 * |        |          |1 = SPI1 Clock Enabled.
 * |[14]    |SPI2CKEN  |SPI2 Clock Enable Bit
 * |        |          |0 = SPI2 Clock Disabled.
 * |        |          |1 = SPI2 Clock Enabled.
 * |[16]    |UART0CKEN |UART0 Clock Enable Bit
 * |        |          |0 = UART0 clock Disabled.
 * |        |          |1 = UART0 clock Enabled.
 * |[17]    |UART1CKEN |UART1 Clock Enable Bit
 * |        |          |0 = UART1 clock Disabled.
 * |        |          |1 = UART1 clock Enabled.
 * |[18]    |UART2CKEN |UART2 Clock Enable Bit
 * |        |          |0 = UART2 clock Disabled.
 * |        |          |1 = UART2 clock Enabled.
 * |[19]    |UART3CKEN |UART3 Clock Enable Bit
 * |        |          |0 = UART3 clock Disabled.
 * |        |          |1 = UART3 clock Enabled.
 * |[24]    |CAN0CKEN  |CAN0 Clock Enable Bit
 * |        |          |0 = CAN0 clock Disabled.
 * |        |          |1 = CAN0 clock Enabled.
 * |[26]    |OTGCKEN   |USB OTG Clock Enable Bit
 * |        |          |0 = USB OTG clock Disabled.
 * |        |          |1 = USB OTG clock Enabled.
 * |[27]    |USBDCKEN  |USB Device Clock Enable Bit
 * |        |          |0 = USB Device clock Disabled.
 * |        |          |1 = USB Device clock Enabled.
 * |[28]    |EADCCKEN  |Enhanced Analog-Digital-Converter (EADC) Clock Enable Bit
 * |        |          |0 = EADC clock Disabled.
 * |        |          |1 = EADC clock Enabled.
 * @var CLK_T::APBCLK1
 * Offset: 0x0C  APB Devices Clock Enable Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SC0CKEN   |SC0 Clock Enable Bit
 * |        |          |0 = SC0 Clock Disabled.
 * |        |          |1 = SC0 Clock Enabled.
 * |[12]    |DACCKEN   |DAC Clock Enable Bit
 * |        |          |0 = DAC Clock Disabled.
 * |        |          |1 = DAC Clock Enabled.
 * |[16]    |PWM0CKEN  |PWM0 Clock Enable Bit
 * |        |          |0 = PWM0 Clock Disabled.
 * |        |          |1 = PWM0 Clock Enabled.
 * |[17]    |PWM1CKEN  |PWM1 Clock Enable Bit
 * |        |          |0 = PWM1 Clock Disabled.
 * |        |          |1 = PWM1 Clock Enabled.
 * |[25]    |TKCKEN    |Touch Key Clock Enable Bit
 * |        |          |0 = Touch Key Clock Disabled.
 * |        |          |1 = Touch key Clock Enabled.
 * @var CLK_T::CLKSEL0
 * Offset: 0x10  Clock Source Select Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |HCLKSEL   |HCLK Clock Source Selection (Write Protect)
 * |        |          |Before clock switching, the related clock sources (both pre-select and new-select) must be turned on.
 * |        |          |The default value is reloaded from the value of CFOSC (CONFIG0[26:24]) in user configuration register of Flash controller by any reset.
 * |        |          |Therefore the default value is either 000b or 111b.
 * |        |          |000 = Clock source from external 4~24 MHz high-speed crystal clock.
 * |        |          |001 = Clock source from external 32.768 kHz low-speed crystal clock.
 * |        |          |010 = Clock source from PLL clock.
 * |        |          |011 = Clock source from internal 10 kHz low-speed oscillator clock.
 * |        |          |111= Clock source from internal 22.1184 MHz high-speed oscillator clock.
 * |        |          |Other = Reserved.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[5:3]   |STCLKSEL  |Cortex-M4 SysTick Clock Source Selection (Write Protect)
 * |        |          |If SYST_CTRL[2]=0, SysTick uses listed clock source below.
 * |        |          |000 = Clock source from external 4~24 MHz high-speed crystal clock.
 * |        |          |001 = Clock source from external 32.768 kHz low-speed crystal clock.
 * |        |          |010 = Clock source from external 4~24 MHz high-speed crystal clock/2.
 * |        |          |011 = Clock source from HCLK/2.
 * |        |          |111 = Clock source from internal 22.1184 MHz high-speed oscillator clock/2.
 * |        |          |Note: if SysTick clock source is not from HCLK (i.e.
 * |        |          |SYST_CTRL[2] = 0), SysTick clock source must less than or equal to HCLK/2.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[6]     |PCLK0SEL  |PCLK0 Clock Source Selection (Write Protect)
 * |        |          |0 = APB0 BUS clock source from HCLK.
 * |        |          |1 = APB0 BUS clock source from HCLK/2.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |[7]     |PCLK1SEL  |PCLK1 Clock Source Selection (Write Protect)
 * |        |          |0 = APB1 BUS clock source from HCLK.
 * |        |          |1 = APB1 BUS clock source from HCLK/2.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * @var CLK_T::CLKSEL1
 * Offset: 0x14  Clock Source Select Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |WDTSEL    |Watchdog Timer Clock Source Selection (Write Protect)
 * |        |          |00 = Reserved.
 * |        |          |01 = Clock source from external 32.768 kHz low-speed crystal clock.
 * |        |          |10 = Clock source from HCLK/2048 clock.
 * |        |          |11 = Clock source from internal 10 kHz low-speed oscillator clock.
 * |[10:8]  |TMR0SEL   |TIMER0 Clock Source Selection
 * |        |          |000 = Clock source from external 4~24 MHz high-speed crystal clock.
 * |        |          |001 = Clock source from external 32.768 kHz low-speed crystal clock.
 * |        |          |010 = Clock source from PCLK0.
 * |        |          |011 = Clock source from external clock T0 pin
 * |        |          |101 = Clock source from internal 10 kHz low-speed oscillator clock.
 * |        |          |111 = Clock source from internal 22.1184 MHz high-speed oscillator clock.
 * |        |          |Others = Reserved.
 * |[14:12] |TMR1SEL   |TIMER1 Clock Source Selection
 * |        |          |000 = Clock source from external 4~24 MHz high-speed crystal clock.
 * |        |          |001 = Clock source from external 32.768 kHz low-speed crystal clock.
 * |        |          |010 = Clock source from PCLK0.
 * |        |          |011 = Clock source from external clock T1 pin
 * |        |          |101 = Clock source from internal 10 kHz low-speed oscillator clock.
 * |        |          |111 = Clock source from internal 22.1184 MHz high-speed oscillator clock.
 * |        |          |Others = Reserved.
 * |[18:16] |TMR2SEL   |TIMER2 Clock Source Selection
 * |        |          |000 = Clock source from external 4~24 MHz high-speed crystal clock.
 * |        |          |001 = Clock source from external 32.768 kHz low-speed crystal clock.
 * |        |          |010 = Clock source from PCLK1.
 * |        |          |011 = Clock source from external clock T2 pin
 * |        |          |101 = Clock source from internal 10 kHz low-speed oscillator clock.
 * |        |          |111 = Clock source from internal 22.1184 MHz high-speed oscillator clock.
 * |        |          |Others = Reserved.
 * |[22:20] |TMR3SEL   |TIMER3 Clock Source Selection
 * |        |          |000 = Clock source from external 4~24 MHz high-speed crystal clock.
 * |        |          |001 = Clock source from external 32.768 kHz low-speed crystal clock.
 * |        |          |010 = Clock source from PCLK1.
 * |        |          |011 = Clock source from external clock T3 pin.
 * |        |          |101 = Clock source from internal 10 kHz low-speed oscillator clock.
 * |        |          |111 = Clock source from internal 22.1184 MHz high-speed oscillator clock.
 * |        |          |Others = Reserved.
 * |[25:24] |UARTSEL   |UART Clock Source Selection
 * |        |          |00 = Clock source from external 4~24 MHz high-speed crystal clock (HXT).
 * |        |          |01 = Clock source from PLL clock.
 * |        |          |10 = Clock source from 32.768 kHz external low speed crystal oscillator (LXT).
 * |        |          |11 = Clock source from internal 22.1184 MHz high-speed oscillator clock (HIRC).
 * |[29:28] |CLKOSEL   |Clock Divider Clock Source Selection
 * |        |          |00 = Clock source from external 4~24 MHz high-speed crystal clock.
 * |        |          |01 = Clock source from external 32.768 kHz low-speed crystal clock.
 * |        |          |10 = Clock source from HCLK.
 * |        |          |11 = Clock source from internal 22.1184 MHz high-speed oscillator clock.
 * |[31:30] |WWDTSEL   |Window Watchdog Timer Clock Source Selection
 * |        |          |10 = Clock source from HCLK/2048 clock.
 * |        |          |11 = Clock source from internal 10 kHz low-speed oscillator clock.
 * |        |          |Others = Reserved.
 * @var CLK_T::CLKSEL2
 * Offset: 0x18  Clock Source Select Control Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWM0SEL   |PWM0 Clock Source Selection
