MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M4521LE6AE/mcu.h
 * |        |          |The peripheral clock source of PWM0 is defined by PWM0SEL.
 * |        |          |0 = Clock source from PLL clock.
 * |        |          |1 = Clock source from PCLK0.
 * |[1]     |PWM1SEL   |PWM1 Clock Source Selection
 * |        |          |The peripheral clock source of PWM1 is defined by PWM1SEL.
 * |        |          |0 = Clock source from PLL clock.
 * |        |          |1 = Clock source from PCLK1.
 * |[3:2]   |SPI0SEL   |SPI0 Clock Source Selection
 * |        |          |00 = Clock source from external 4~24 MHz high speed crystal oscillator clock.
 * |        |          |01 = Clock source from PLL clock.
 * |        |          |10 = Clock source from PCLK0.
 * |        |          |11 = Clock source from internal 22.1184 MHz high speed oscillator clock.
 * |[5:4]   |SPI1SEL   |SPI1 Clock Source Selection
 * |        |          |00 = Clock source from external 4~24 MHz high speed crystal oscillator clock.
 * |        |          |01 = Clock source from PLL clock.
 * |        |          |10 = Clock source from PCLK1.
 * |        |          |11 = Clock source from internal 22.1184 MHz high speed oscillator clock.
 * |[7:6]   |SPI2SEL   |SPI2 Clock Source Selection
 * |        |          |00 = Clock source from external 4~24 MHz high speed crystal oscillator clock.
 * |        |          |01 = Clock source from PLL clock.
 * |        |          |10 = Clock source from PCLK0.
 * |        |          |11 = Clock source from internal 22.1184 MHz high speed oscillator clock.
 * @var CLK_T::CLKSEL3
 * Offset: 0x1C  Clock Source Select Control Register 3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |SC0SEL    |SC0 Clock Source Selection
 * |        |          |00 = Clock source from external 4~24 MHz high-speed crystal clock.
 * |        |          |01 = Clock source from PLL clock.
 * |        |          |10 = Clock source from PCLK0.
 * |        |          |11 = Clock source from internal 22.1184 MHz high-speed oscillator clock.
 * |[8]     |RTCSEL    |RTC Clock Source Selection
 * |        |          |0 = Clock source from external 32.768 kHz low-speed oscillator.
 * |        |          |1 = Clock source from internal 10 kHz low speed RC oscillator.
 * @var CLK_T::CLKDIV0
 * Offset: 0x20  Clock Divider Number Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |HCLKDIV   |HCLK Clock Divide Number From HCLK Clock Source
 * |        |          |HCLK clock frequency = (HCLK clock source frequency) / (HCLKDIV + 1).
 * |[7:4]   |USBDIV    |USB Clock Divide Number From PLL Clock
 * |        |          |USB clock frequency = (PLL frequency) / (USBDIV + 1).
 * |[11:8]  |UARTDIV   |UART Clock Divide Number From UART Clock Source
 * |        |          |UART clock frequency = (UART clock source frequency) / (UARTDIV + 1).
 * |[23:16] |EADCDIV   |EADC Clock Divide Number From EADC Clock Source
 * |        |          |EADC clock frequency = (EADC clock source frequency) / (EADCDIV + 1).
 * @var CLK_T::CLKDIV1
 * Offset: 0x24  Clock Divider Number Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |SC0DIV    |SC0 Clock Divide Number From SC0 Clock Source
 * |        |          |SC0 clock frequency = (SC0 clock source frequency ) / (SC0DIV + 1).
 * @var CLK_T::PLLCTL
 * Offset: 0x40  PLL Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[8:0]   |FBDIV     |PLL Feedback Divider Control Pins (Write Protect)
 * |        |          |Refer to the formulas below the table.
 * |[13:9]  |INDIV     |PLL Input Divider Control Pins (Write Protect)
 * |        |          |Refer to the formulas below the table.
 * |[15:14] |OUTDIV    |PLL Output Divider Control Pins (Write Protect)
 * |        |          |Refer to the formulas below the table.
 * |[16]    |PD        |Power-Down Mode (Write Protect)
 * |        |          |If set the PDEN bit to 1 in CLK_PWRCTL register, the PLL will enter Power-down mode, too.
 * |        |          |0 = PLL is in normal mode.
 * |        |          |1 = PLL is in Power-down mode (default).
 * |[17]    |BP        |PLL Bypass Control (Write Protect)
 * |        |          |0 = PLL is in normal mode (default).
 * |        |          |1 = PLL clock output is same as PLL input clock FIN.
 * |[18]    |OE        |PLL OE (FOUT Enable) Pin Control (Write Protect)
 * |        |          |0 = PLL FOUT Enabled.
 * |        |          |1 = PLL FOUT is fixed low.
 * |[19]    |PLLSRC    |PLL Source Clock Selection (Write Protect)
 * |        |          |0 = PLL source clock from external 4~24 MHz high-speed crystal (HXT).
 * |        |          |1 = PLL source clock from internal 22.1184 MHz high-speed oscillator (HIRC).
 * |[23]    |STBSEL    |PLL Stable Counter Selection (Write Protect)
 * |        |          |0 = PLL stable time is 6144 PLL source clock (suitable for source clock is equal to or less than 12MHz).
 * |        |          |1 = PLL stable time is 12288 PLL source clock (suitable for source clock is larger than 12MHz).
 * @var CLK_T::STATUS
 * Offset: 0x50  Clock Status Monitor Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |HXTSTB    |External 4~24 MHz High-Speed Crystal Clock Source Stable Flag (Read Only)
 * |        |          |0 = External 4~24 MHz high-speed crystal clock is not stable or disabled.
 * |        |          |1 = External 4~24 MHz high-speed crystal clock is stable and enabled.
 * |[1]     |LXTSTB    |External 32.768 kHz Low-Speed Crystal Clock Source Stable Flag (Read Only)
 * |        |          |0 = External 32.768 kHz low-speed crystal clock is not stable or disabled.
 * |        |          |1 = External 32.768 kHz low-speed crystal clock is stabled and enabled.
 * |[2]     |PLLSTB    |Internal PLL Clock Source Stable Flag (Read Only)
 * |        |          |0 = Internal PLL clock is not stable or disabled.
 * |        |          |1 = Internal PLL clock is stable and enabled.
 * |[3]     |LIRCSTB   |Internal 10 KHz Low-Speed Oscillator Clock Source Stable Flag (Read Only)
 * |        |          |0 = Internal 10 kHz low-speed oscillator clock is not stable or disabled.
 * |        |          |1 = Internal 10 kHz low-speed oscillator clock is stable and enabled.
 * |[4]     |HIRCSTB   |Internal 22.1184 MHz High-Speed Oscillator Clock Source Stable Flag (Read Only)
 * |        |          |0 = Internal 22.1184 MHz high-speed oscillator clock is not stable or disabled.
 * |        |          |1 = Internal 22.1184 MHz high-speed oscillator clock is stable and enabled.
 * |[7]     |CLKSFAIL  |Clock Switching Fail Flag (Read Only)
 * |        |          |This bit is up2025-06-04d when software switches system clock source.
 * |        |          |If switch target clock is stable, this bit will be set to 0.
 * |        |          |If switch target clock is not stable, this bit will be set to 1.
 * |        |          |0 = Clock switching success.
 * |        |          |1 = Clock switching failure.
 * |        |          |Note: Write 1 to clear the bit to 0.
 * @var CLK_T::CLKOCTL
 * Offset: 0x60  Clock Output Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |FREQSEL   |Clock Output Frequency Selection
 * |        |          |The formula of output frequency is
 * |        |          |Fout = Fin/2(N+1).
 * |        |          |Fin is the input clock frequency.
 * |        |          |Fout is the frequency of divider output clock.
 * |        |          |N is the 4-bit value of FREQSEL[3:0].
 * |[4]     |CLKOEN    |Clock Output Enable Bit
 * |        |          |0 =Clock Output function Disabled.
 * |        |          |1 = Clock Output function Enabled.
 * |[5]     |DIV1EN    |Clock Output Divide One Enable Bit
 * |        |          |0 = Clock Output will output clock with source frequency divided by FREQSEL.
 * |        |          |1 = Clock Output will output clock with source frequency.
 * |[6]     |CLK1HZEN  |Clock Output 1Hz Enable Bit
 * |        |          |0 = 1 Hz clock output for 32.768kHz frequency compensation Disabled.
 * |        |          |1 = 1 Hz clock output for 332.768kHz frequency compensation Enabled.
 * @var CLK_T::CLKDCTL
 * Offset: 0x70  Clock Fail Detector Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4]     |HXTFDEN   |HXT Clock Fail Detector Enable Bit
 * |        |          |0 = HXT clock Fail detector Disabled.
 * |        |          |1 = HXT clock Fail detector Enabled.
 * |[5]     |HXTFIEN   |HXT Clock Fail Interrupt Enable Bit
 * |        |          |0 = HXT clock Fail interrupt Disabled.
 * |        |          |1 = HXT clock Fail interrupt Enabled.
 * |[12]    |LXTFDEN   |LXT Clock Fail Detector Enable Bit
 * |        |          |0 = LXT clock Fail detector Disabled.
 * |        |          |1 = LXT clock Fail detector Enabled.
 * |[13]    |LXTFIEN   |LXT Clock Fail Interrupt Enable Bit
 * |        |          |0 = LXT clock Fail interrupt Disabled.
 * |        |          |1 = LXT clock Fail interrupt Enabled.
 * |[16]    |HXTFQDEN  |HXT Clock Frequency Monitor Enable Bit
 * |        |          |0 = HXT clock frequency monitor Disabled.
 * |        |          |1 = HXT clock frequency monitor Enabled.
 * |[17]    |HXTFQIEN  |HXT Clock Frequency Monitor Interrupt Enable Bit
 * |        |          |0 = HXT clock frequency monitor fail interrupt Disabled.
 * |        |          |1 = HXT clock frequency monitor fail interrupt Enabled.
 * @var CLK_T::CLKDSTS
 * Offset: 0x74  Clock Fail Detector Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |HXTFIF    |HXT Clock Fail Interrupt Flag
 * |        |          |0 = HXT clock normal.
 * |        |          |1 = HXT clock stop
 * |        |          |Note: Write 1 to clear the bit to 0.
 * |[1]     |LXTFIF    |LXT Clock Fail Interrupt Flag
 * |        |          |0 = LXT clock normal.
 * |        |          |1 = LXT stop
 * |        |          |Note: Write 1 to clear the bit to 0.
 * |[8]     |HXTFQIF   |HXT Clock Frequency Monitor Interrupt Flag
 * |        |          |0 = HXT clock normal.
 * |        |          |1 = HXT clock frequency abnormal
 * |        |          |Note: Write 1 to clear the bit to 0.
 * @var CLK_T::CDUPB
 * Offset: 0x78  Clock Frequency Detector Upper Boundary Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[9:0]   |UPERBD    |HXT Clock Frequency Detector Upper Boundary
 * |        |          |The bits define the high value of frequency monitor window.
 * |        |          |When HXT frequency monitor value higher than this register, the HXT frequency detect fail interrupt flag will set to 1.
 * @var CLK_T::CDLOWB
 * Offset: 0x7C  Clock Frequency Detector Low Boundary Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[9:0]   |LOWERBD   |HXT Clock Frequency Detector Low Boundary
 * |        |          |The bits define the low value of frequency monitor window.
 * |        |          |When HXT frequency monitor value lower than this register, the HXT frequency detect fail interrupt flag will set to 1.
 */

