MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M4521LE6AE/mcu.h
/*---------------------- Digital to Analog Converter -------------------------*/
/**
    @addtogroup DAC Digital to Analog Converter(DAC)
    Memory Mapped Structure for DAC Controller
@{ */


typedef struct
{



/**
 * @var DAC_T::CTL
 * Offset: 0x00  DAC Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |DACEN     |DAC Enable Bit
 * |        |          |0 = DAC is Disabled.
 * |        |          |1 = DAC is Enabled.
 * |[1]     |DACIEN    |DAC Interrupt Enable Bit
 * |        |          |0 = Interrupt is Disabled.
 * |        |          |1 = Interrupt is Enabled.
 * |[2]     |DMAEN     |DMA Mode Enable Bit
 * |        |          |0 = DMA mode Disabled.
 * |        |          |1 = DMA mode Enabled.
 * |[3]     |DMAURIEN  |DMA Under-Run Interrupt Enable Bit
 * |        |          |0 = DMA under run interrupt Disabled.
 * |        |          |1 = DMA under run interrupt Enabled.
 * |[4]     |TRGEN     |Trigger Mode Enable Bit
 * |        |          |0 = DAC event trigger mode Disabled.
 * |        |          |1 = DAC event trigger mode Enabled.
 * |[7:5]   |TRGSEL    |Trigger Source Selection
 * |        |          |000 = Software trigger.
 * |        |          |001 = External pin STDAC trigger.
 * |        |          |010 = Timer 0 trigger.
 * |        |          |011 = Timer 1 trigger.
 * |        |          |100 = Timer 2 trigger.
 * |        |          |101 = Timer 3 trigger.
 * |        |          |110 = PWM0 trigger.
 * |        |          |111 = PWM1 trigger.
 * |[8]     |BYPASS    |Bypass Buffer Mode
 * |        |          |0 = Output voltage buffer Enabled.
 * |        |          |1 = Output voltage buffer Disabled.
 * |[10]    |LALIGN    |DAC Data Left-Aligned Enabled Control
 * |        |          |0 = Right alignment.
 * |        |          |1 = Left alignment.
 * |[13:12] |ETRGSEL   |External Pin Trigger Selection
 * |        |          |00 = Low level trigger.
 * |        |          |01 = High level trigger.
 * |        |          |10 = Falling edge trigger.
 * |        |          |11 = Rising edge trigger.
 * @var DAC_T::SWTRG
 * Offset: 0x04  DAC Software Trigger Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SWTRG     |Software Trigger
 * |        |          |0 = Software trigger Disabled.
 * |        |          |1 = Software trigger Enabled.
 * |        |          |User writes this bit to generate one shot pulse and it is cleared to 0 by hardware automatically; Reading this bit will always get 0.
 * @var DAC_T::DAT
 * Offset: 0x08  DAC Data Holding Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |DAC_DAT   |DAC 12-Bit Holding Data
 * |        |          |These bits are written by user software which specifies 12-bit conversion data for DAC output.
 * |        |          |The unused bits (DAC_DAT[3:0] in left-alignment mode and DAC_DAT[15:12] in right alignment mode) are ignored by DAC controller hardware.
 * |        |          |12 bit left alignment: user has to load data into DAC_DAT[15:4] bits.
 * |        |          |12 bit right alignment: user has to load data into DAC_DAT[11:0] bits.
 * @var DAC_T::DATOUT
 * Offset: 0x0C  DAC Data Output Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |DATOUT    |DAC 12-Bit Output Data
 * |        |          |These bits are current digital data for DAC output conversion.
 * |        |          |It is loaded from DAC_DAT register and user cannot write it directly.
 * @var DAC_T::STATUS
 * Offset: 0x10  DAC Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |FINISH    |DAC Conversion Complete Finish Flag
 * |        |          |0 = DAC is in conversion state.
 * |        |          |1 = DAC conversion finish.
 * |        |          |This bit set to 1 when conversion time counter counts to SETTLET.
 * |        |          |It is cleared to 0 when DAC starts a new conversion.
 * |        |          |User writes 1 to clear this bit to 0.
 * |[1]     |DMAUDR    |DMA Under Run Interrupt Flag
 * |        |          |0 = No DMA under-run error condition occurred.
 * |        |          |1 = DMA under-run error condition occurred.
 * |        |          |User writes 1 to clear this bit.
 * |[8]     |BUSY      |DAC Busy Flag (Read Only)
 * |        |          |0 = DAC is ready for next conversion.
 * |        |          |1 = DAC is busy in conversion.
 * |        |          |This is read only bit.
 * @var DAC_T::TCTL
 * Offset: 0x14  DAC Timing Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[9:0]   |SETTLET   |DAC Output Settling Time
 * |        |          |User software needs to write appropriate value to these bits to meet DAC conversion settling time base on PCLK (APB clock) speed.
 * |        |          |For example, DAC controller clock speed is 72MHz and DAC conversion setting time is 1 us, SETTLET value must be greater than 0x48.
 */

    __IO uint32_t CTL;           /* Offset: 0x00  DAC Control Register                                               */
    __IO uint32_t SWTRG;         /* Offset: 0x04  DAC Software Trigger Control Register                              */
    __IO uint32_t DAT;           /* Offset: 0x08  DAC Data Holding Register                                          */
    __I  uint32_t DATOUT;        /* Offset: 0x0C  DAC Data Output Register                                           */
    __IO uint32_t STATUS;        /* Offset: 0x10  DAC Status Register                                                */
    __IO uint32_t TCTL;          /* Offset: 0x14  DAC Timing Control Register                                        */

} DAC_T;



/**
    @addtogroup DAC_CONST DAC Bit Field Definition
    Constant Definitions for DAC Controller
@{ */

#define DAC_CTL_DACEN_Pos                (0)                                               /*!< DAC_T::CTL: DACEN Position                */
#define DAC_CTL_DACEN_Msk                (0x1ul << DAC_CTL_DACEN_Pos)                      /*!< DAC_T::CTL: DACEN Mask                    */

#define DAC_CTL_DACIEN_Pos               (1)                                               /*!< DAC_T::CTL: DACIEN Position               */
#define DAC_CTL_DACIEN_Msk               (0x1ul << DAC_CTL_DACIEN_Pos)                     /*!< DAC_T::CTL: DACIEN Mask                   */

#define DAC_CTL_DMAEN_Pos                (2)                                               /*!< DAC_T::CTL: DMAEN Position                */
#define DAC_CTL_DMAEN_Msk                (0x1ul << DAC_CTL_DMAEN_Pos)                      /*!< DAC_T::CTL: DMAEN Mask                    */

#define DAC_CTL_DMAURIEN_Pos             (3)                                               /*!< DAC_T::CTL: DMAURIEN Position             */
#define DAC_CTL_DMAURIEN_Msk             (0x1ul << DAC_CTL_DMAURIEN_Pos)                   /*!< DAC_T::CTL: DMAURIEN Mask                 */

#define DAC_CTL_TRGEN_Pos                (4)                                               /*!< DAC_T::CTL: TRGEN Position                */
#define DAC_CTL_TRGEN_Msk                (0x1ul << DAC_CTL_TRGEN_Pos)                      /*!< DAC_T::CTL: TRGEN Mask                    */

