MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M4521LE6AE/mcu.h
 * |        |          |Note: Software can write 1 to clear this bit.
 * |[2]     |PECERR    |PEC Error In Reception
 * |        |          |0 = Indicates the PEC value equal the received PEC data packet.
 * |        |          |1 = Indicates the PEC value doesn't match the receive PEC data packet.
 * |        |          |Note: Software can write 1 to clear this bit.
 * |[3]     |ALERT     |SMBus Alert Status
 * |        |          |Device Mode (BMHEN =0).
 * |        |          |0 = Indicates SMALERT pin state is low.
 * |        |          |1 = Indicates SMALERT pin state is high
 * |        |          |Host Mode (BMHEN =1).
 * |        |          |0 = No SMBALERT event.
 * |        |          |1 = Indicates there is SMBALERT event (falling edge) is detected in SMALERT pin when the BMHEN = 1 (SMBus host configuration) and the ALERTEN = 1.
 * |        |          |Note: 1.
 * |        |          |The SMALERT pin is an open-drain pin, the pull-high resistor is must in the system.
 * |        |          |2.
 * |        |          |Software can write 1 to clear this bit.
 * |[4]     |SCTLDIN   |Bus Suspend Or Control Signal Input Status
 * |        |          |0 = The input status of SUSCON pin is 0.
 * |        |          |1 = The input status of SUSCON pin is 1.
 * |[5]     |BUSTO     |Bus Time-out Status
 * |        |          |0 = Indicates that there is no any time-out or external clock time-out.
 * |        |          |1 = Indicates that a time-out or external clock time-out occurred.
 * |        |          |In bus busy, the bit indicates the total clock low time-out event occurred otherwise, it indicates the bus idle time-out event occurred.
 * |        |          |Note: Software can write 1 to clear this bit.
 * |[6]     |CLKTO     |Clock Low Cumulate Time-out Status
 * |        |          |0 = Indicates that the cumulative clock low is no any time-out.
 * |        |          |1 = Indicates that the cumulative clock low time-out occurred.
 * |        |          |Note: Software can write 1 to clear this bit.
 * @var I2C_T::PKTSIZE
 * Offset: 0x50  I2C Packet Error Checking Byte Number Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |PLDSIZE   |Transfer Byte Number
 * |        |          |The transmission or receive byte number in one transaction when the PECEN is set.
 * |        |          |The maximum transaction or receive byte is 255 Bytes.
 * @var I2C_T::PKTCRC
 * Offset: 0x54  I2C Packet Error Checking Byte Value Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |PECCRC    |Packet Error Checking Byte Value
 * |        |          |This byte indicates the packet error checking content after transmission or receive byte count by using the C(x) = X8 + X2 + X + 1.
 * |        |          |I t is read only.
 * @var I2C_T::BUSTOUT
 * Offset: 0x58  I2C Bus Management Timer Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |BUSTO     |Bus Management Time-out Value
 * |        |          |Indicate the bus time-out value in bus is IDLE or SCLK low.
 * |        |          |Note: If the user wants to revise the value of BUSTOUT, the TORSTEN (I2C_BUSTCTL[4]) bit shall be set to 1 and clear to 0 first in the BUSEN(I2C_BUSCTL[7]) is set.
 * @var I2C_T::CLKTOUT
 * Offset: 0x5C  I2C Bus Management Clock Low Timer Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CLKTO     |Bus Clock Low Timer
 * |        |          |The field is used to configure the cumulative clock extension time-out.
 * |        |          |Note: If the user wants to revise the value of CLKLTOUT, the TORSTEN bit shall be set to 1 and d clear to 0 first in the BUSEN is set.
    */

    __IO uint32_t CTL;           /* Offset: 0x00  I2C Control Register                                               */
    __IO uint32_t ADDR0;         /* Offset: 0x04  I2C Slave Address Register0                                        */
    __IO uint32_t DAT;           /* Offset: 0x08  I2C Data Register                                                  */
    __I  uint32_t STATUS;        /* Offset: 0x0C  I2C Status Register                                                */
    __IO uint32_t CLKDIV;        /* Offset: 0x10  I2C Clock Divided Register                                         */
    __IO uint32_t TOCTL;         /* Offset: 0x14  I2C Time-out Control Register                                      */
    __IO uint32_t ADDR1;         /* Offset: 0x18  I2C Slave Address Register1                                        */
    __IO uint32_t ADDR2;         /* Offset: 0x1C  I2C Slave Address Register2                                        */
    __IO uint32_t ADDR3;         /* Offset: 0x20  I2C Slave Address Register3                                        */
    __IO uint32_t ADDRMSK0;      /* Offset: 0x24  I2C Slave Address Mask Register0                                   */
    __IO uint32_t ADDRMSK1;      /* Offset: 0x28  I2C Slave Address Mask Register1                                   */
    __IO uint32_t ADDRMSK2;      /* Offset: 0x2C  I2C Slave Address Mask Register2                                   */
    __IO uint32_t ADDRMSK3;      /* Offset: 0x30  I2C Slave Address Mask Register3                                   */
    __I  uint32_t RESERVE0[2];  
    __IO uint32_t WKCTL;         /* Offset: 0x3C  I2C Wake-up Control Register                                       */
    __IO uint32_t WKSTS;         /* Offset: 0x40  I2C Wake-up Status Register                                        */
    __IO uint32_t BUSCTL;        /* Offset: 0x44  I2C Bus Management Control Register                                */
    __IO uint32_t BUSTCTL;       /* Offset: 0x48  I2C Bus Management Timer Control Register                          */
    __IO uint32_t BUSSTS;        /* Offset: 0x4C  I2C Bus Management Status Register                                 */
    __IO uint32_t PKTSIZE;       /* Offset: 0x50  I2C Packet Error Checking Byte Number Register                     */
    __I  uint32_t PKTCRC;        /* Offset: 0x54  I2C Packet Error Checking Byte Value Register                      */
    __IO uint32_t BUSTOUT;       /* Offset: 0x58  I2C Bus Management Timer Register                                  */
    __IO uint32_t CLKTOUT;       /* Offset: 0x5C  I2C Bus Management Clock Low Timer Register                        */

