MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M4521LE6AE/mcu.h
 * |        |          |0 = Period point interrupt Disabled.
 * |        |          |1 = Period point interrupt Enabled.
 * |        |          |Note1: When up-down counter type period point means center point.
 * |        |          |Note2: Odd channels will read always 0 at complementary mode.
 * |[15]    |IFAIEN2_3 |PWM_CH2/3 Interrupt Flag Accumulator Interrupt Enable
 * |        |          |0 = Interrupt Flag accumulator interrupt Disabled.
 * |        |          |1 = Interrupt Flag accumulator interrupt Enabled.
 * |[21:16] |CMPUIENn  |PWM Compare Up Count Interrupt Enable
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = Compare up count interrupt Disabled.
 * |        |          |1 = Compare up count interrupt Enabled.
 * |        |          |Note: In complementary mode, CMPUIEN1, 3, 5 use as another CMPUIEN for channel 0, 2, 4.
 * |[23]    |IFAIEN4_5 |PWM_CH4/5 Interrupt Flag Accumulator Interrupt Enable
 * |        |          |0 = Interrupt Flag accumulator interrupt Disabled.
 * |        |          |1 = Interrupt Flag accumulator interrupt Enabled.
 * |[29:24] |CMPDIENn  |PWM Compare Down Count Interrupt Enable
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = Compare down count interrupt Disabled.
 * |        |          |1 = Compare down count interrupt Enabled.
 * |        |          |Note: In complementary mode, CMPDIEN1, 3, 5 use as another CMPDIEN for channel 0, 2, 4.
 * @var PWM_T::INTEN1
 * Offset: 0xE4  PWM Interrupt Enable Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |BRKEIEN0_1|PWM Edge-Detect Brake Interrupt Enable For Channel0/1 (Write Protect)
 * |        |          |0 = Edge-detect Brake interrupt for channel0/1 Disabled.
 * |        |          |1 = Edge-detect Brake interrupt for channel0/1 Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[1]     |BRKEIEN2_3|PWM Edge-Detect Brake Interrupt Enable For Channel2/3 (Write Protect)
 * |        |          |0 = Edge-detect Brake interrupt for channel2/3 Disabled.
 * |        |          |1 = Edge-detect Brake interrupt for channel2/3 Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[2]     |BRKEIEN4_5|PWM Edge-Detect Brake Interrupt Enable For Channel4/5 (Write Protect)
 * |        |          |0 = Edge-detect Brake interrupt for channel4/5 Disabled.
 * |        |          |1 = Edge-detect Brake interrupt for channel4/5 Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[8]     |BRKLIEN0_1|PWM Level-Detect Brake Interrupt Enable For Channel0/1 (Write Protect)
 * |        |          |0 = Level-detect Brake interrupt for channel0/1 Disabled.
 * |        |          |1 = Level-detect Brake interrupt for channel0/1 Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[9]     |BRKLIEN2_3|PWM Level-Detect Brake Interrupt Enable For Channel2/3 (Write Protect)
 * |        |          |0 = Level-detect Brake interrupt for channel2/3 Disabled.
 * |        |          |1 = Level-detect Brake interrupt for channel2/3 Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[10]    |BRKLIEN4_5|PWM Level-Detect Brake Interrupt Enable For Channel4/5 (Write Protect)
 * |        |          |0 = Level-detect Brake interrupt for channel4/5 Disabled.
 * |        |          |1 = Level-detect Brake interrupt for channel4/5 Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * @var PWM_T::INTSTS0
 * Offset: 0xE8  PWM Interrupt Flag Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |ZIFn      |PWM Zero Point Interrupt Flag
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |This bit is set by hardware when PWM counter reaches zero, software can write 1 to clear this bit to zero.
 * |[7]     |IFAIF0_1  |PWM_CH0/1 Interrupt Flag Accumulator Interrupt Flag
 * |        |          |Flag is set by hardware when condition match IFSEL0_1 in PWM_IFA register, software can clear this bit by writing 1 to it.
 * |[13:8]  |PIFn      |PWM Period Point Interrupt Flag
 * |        |          |This bit is set by hardware when PWM counter reaches PWM_PERIODn, software can write 1 to clear this bit to zero.
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |[15]    |IFAIF2_3  |PWM_CH2/3 Interrupt Flag Accumulator Interrupt Flag
 * |        |          |Flag is set by hardware when condition match IFSEL2_3 in PWM_IFA register, software can clear this bit by writing 1 to it.
 * |[21:16] |CMPUIFn   |PWM Compare Up Count Interrupt Flag
 * |        |          |Flag is set by hardware when PWM counter up count and reaches PWM_CMPDATn, software can clear this bit by writing 1 to it.
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |Note1: If CMPDAT equal to PERIOD, this flag is not working in up counter type selection.
 * |        |          |Note2: In complementary mode, CMPUIF1, 3, 5 use as another CMPUIF for channel 0, 2, 4.
 * |[23]    |IFAIF4_5  |PWM_CH4/5 Interrupt Flag Accumulator Interrupt Flag
 * |        |          |Flag is set by hardware when condition match IFSEL4_5 in PWM_IFA register, software can clear this bit by writing 1 to it.
 * |[29:24] |CMPDIFn   |PWM Compare Down Count Interrupt Flag
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |Flag is set by hardware when PWM counter down count and reaches PWM_CMPDATn, software can clear this bit by writing 1 to it.
 * |        |          |Note1: If CMPDAT equal to PERIOD, this flag is not working in down counter type selection.
 * |        |          |Note2: In complementary mode, CMPDIF1, 3, 5 use as another CMPDIF for channel 0, 2, 4.
 * @var PWM_T::INTSTS1
 * Offset: 0xEC  PWM Interrupt Flag Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |BRKEIF0   |PWM Channel0 Edge-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel0 edge-detect brake event do not happened.
 * |        |          |1 = When PWM channel0 edge-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[1]     |BRKEIF1   |PWM Channel1 Edge-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel1 edge-detect brake event do not happened.
 * |        |          |1 = When PWM channel1 edge-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[2]     |BRKEIF2   |PWM Channel2 Edge-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel2 edge-detect brake event do not happened.
 * |        |          |1 = When PWM channel2 edge-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[3]     |BRKEIF3   |PWM Channel3 Edge-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel3 edge-detect brake event do not happened.
 * |        |          |1 = When PWM channel3 edge-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[4]     |BRKEIF4   |PWM Channel4 Edge-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel4 edge-detect brake event do not happened.
 * |        |          |1 = When PWM channel4 edge-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[5]     |BRKEIF5   |PWM Channel5 Edge-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel5 edge-detect brake event do not happened.
 * |        |          |1 = When PWM channel5 edge-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[8]     |BRKLIF0   |PWM Channel0 Level-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel0 level-detect brake event do not happened.
 * |        |          |1 = When PWM channel0 level-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[9]     |BRKLIF1   |PWM Channel1 Level-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel1 level-detect brake event do not happened.
 * |        |          |1 = When PWM channel1 level-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[10]    |BRKLIF2   |PWM Channel2 Level-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel2 level-detect brake event do not happened.
 * |        |          |1 = When PWM channel2 level-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[11]    |BRKLIF3   |PWM Channel3 Level-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel3 level-detect brake event do not happened.
 * |        |          |1 = When PWM channel3 level-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[12]    |BRKLIF4   |PWM Channel4 Level-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel4 level-detect brake event do not happened.
 * |        |          |1 = When PWM channel4 level-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[13]    |BRKLIF5   |PWM Channel5 Level-Detect Brake Interrupt Flag (Write Protect)
 * |        |          |0 = PWM channel5 level-detect brake event do not happened.
 * |        |          |1 = When PWM channel5 level-detect brake event happened, this bit is set to 1, writing 1 to clear.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[16]    |BRKESTS0  |PWM Channel0 Edge-Detect Brake Status
 * |        |          |0 = PWM channel0 edge-detect brake state is released.
 * |        |          |1 = When PWM channel0 edge-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel0 at brake state, writing 1 to clear.
 * |[17]    |BRKESTS1  |PWM Channel1 Edge-Detect Brake Status
 * |        |          |0 = PWM channel1 edge-detect brake state is released.
 * |        |          |1 = When PWM channel1 edge-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel1 at brake state, writing 1 to clear.
 * |[18]    |BRKESTS2  |PWM Channel2 Edge-Detect Brake Status
 * |        |          |0 = PWM channel2 edge-detect brake state is released.
 * |        |          |1 = When PWM channel2 edge-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel2 at brake state, writing 1 to clear.
 * |[19]    |BRKESTS3  |PWM Channel3 Edge-Detect Brake Status
 * |        |          |0 = PWM channel3 edge-detect brake state is released.
 * |        |          |1 = When PWM channel3 edge-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel3 at brake state, writing 1 to clear.
 * |[20]    |BRKESTS4  |PWM Channel4 Edge-Detect Brake Status
 * |        |          |0 = PWM channel4 edge-detect brake state is released.
 * |        |          |1 = When PWM channel4 edge-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel4 at brake state, writing 1 to clear.
 * |[21]    |BRKESTS5  |PWM Channel5 Edge-Detect Brake Status
 * |        |          |0 = PWM channel5 edge-detect brake state is released.
 * |        |          |1 = When PWM channel5 edge-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel5 at brake state, writing 1 to clear.
 * |[24]    |BRKLSTS0  |PWM Channel0 Level-Detect Brake Status (Read Only)
 * |        |          |0 = PWM channel0 level-detect brake state is released.
 * |        |          |1 = When PWM channel0 level-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel0 at brake state.
 * |        |          |Note: This bit is read only and auto cleared by hardware.
 * |        |          |When enabled brake source return to high level, PWM will release brake state until current PWM period finished.
 * |        |          |The PWM waveform will start output from next full PWM period.
 * |[25]    |BRKLSTS1  |PWM Channel1 Level-Detect Brake Status (Read Only)
 * |        |          |0 = PWM channel1 level-detect brake state is released.
 * |        |          |1 = When PWM channel1 level-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel1 at brake state.
 * |        |          |Note: This bit is read only and auto cleared by hardware.
 * |        |          |When enabled brake source return to high level, PWM will release brake state until current PWM period finished.
 * |        |          |The PWM waveform will start output from next full PWM period.
 * |[26]    |BRKLSTS2  |PWM Channel2 Level-Detect Brake Status (Read Only)
 * |        |          |0 = PWM channel2 level-detect brake state is released.
 * |        |          |1 = When PWM channel2 level-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel2 at brake state.
 * |        |          |Note: This bit is read only and auto cleared by hardware.
 * |        |          |When enabled brake source return to high level, PWM will release brake state until current PWM period finished.
 * |        |          |The PWM waveform will start output from next full PWM period.
 * |[27]    |BRKLSTS3  |PWM Channel3 Level-Detect Brake Status (Read Only)
 * |        |          |0 = PWM channel3 level-detect brake state is released.
 * |        |          |1 = When PWM channel3 level-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel3 at brake state.
 * |        |          |Note: This bit is read only and auto cleared by hardware.
 * |        |          |When enabled brake source return to high level, PWM will release brake state until current PWM period finished.
 * |        |          |The PWM waveform will start output from next full PWM period.
 * |[28]    |BRKLSTS4  |PWM Channel4 Level-Detect Brake Status (Read Only)
 * |        |          |0 = PWM channel4 level-detect brake state is released.
 * |        |          |1 = When PWM channel4 level-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel4 at brake state.
 * |        |          |Note: This bit is read only and auto cleared by hardware.
 * |        |          |When enabled brake source return to high level, PWM will release brake state until current PWM period finished.
 * |        |          |The PWM waveform will start output from next full PWM period.
 * |[29]    |BRKLSTS5  |PWM Channel5 Level-Detect Brake Status (Read Only)
 * |        |          |0 = PWM channel5 level-detect brake state is released.
 * |        |          |1 = When PWM channel5 level-detect brake detects a falling edge of any enabled brake source; this flag will be set to indicate the PWM channel5 at brake state.
 * |        |          |Note: This bit is read only and auto cleared by hardware.
 * |        |          |When enabled brake source return to high level, PWM will release brake state until current PWM period finished.
 * |        |          |The PWM waveform will start output from next full PWM period.
 * @var PWM_T::IFA
 * Offset: 0xF0  PWM Interrupt Flag Accumulator Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |IFCNT0_1  |PWM_CH0 And PWM_CH1 Interrupt Flag Counter
 * |        |          |The register sets the count number which defines how many times of PWM_CH0 and PWM_CH1 period occurs to set bit IFAIF0_1 to request the PWM period interrupt.
 * |        |          |PWM flag will be set in every IFCNT0_1 [3:0] times of PWM period.
 * |[6:4]   |IFSEL0_1  |PWM_CH0 And PWM_CH1 Interrupt Flag Accumulator Source Select
 * |        |          |000 = CNT equal to Zero in channel 0.
 * |        |          |001 = CNT equal to PERIOD in channel 0.
 * |        |          |010 = CNT equal to CMPU in channel 0.
 * |        |          |011 = CNT equal to CMPD in channel 0.
 * |        |          |100 = CNT equal to Zero in channel 1.
 * |        |          |101 = CNT equal to PERIOD in channel 1.
 * |        |          |110 = CNT equal to CMPU in channel 1.
 * |        |          |111 = CNT equal to CMPD in channel 1.
 * |[7]     |IFAEN0_1  |PWM_CH0 And PWM_CH1 Interrupt Flag Accumulator Enable
 * |        |          |0 = PWM_CH0 and PWM_CH1 interrupt flag accumulator disable.
 * |        |          |1 = PWM_CH0 and PWM_CH1 interrupt flag accumulator enable.
 * |[11:8]  |IFCNT2_3  |PWM_CH2 And PWM_CH3 Interrupt Flag Counter
 * |        |          |The register sets the count number which defines how many times of PWM_CH2 and PWM_CH3 period occurs to set bit IFAIF2_3 to request the PWM period interrupt.
 * |        |          |PWM flag will be set in every IFCNT2_3[3:0] times of PWM period.
 * |[14:12] |IFSEL2_3  |PWM_CH2 And PWM_CH3 Interrupt Flag Accumulator Source Select
 * |        |          |000 = CNT equal to Zero in channel 2.
 * |        |          |001 = CNT equal to PERIOD in channel 2.
 * |        |          |010 = CNT equal to CMPU in channel 2.
 * |        |          |011 = CNT equal to CMPD in channel 2.
 * |        |          |100 = CNT equal to Zero in channel 3.
 * |        |          |101 = CNT equal to PERIOD in channel 3.
 * |        |          |110 = CNT equal to CMPU in channel 3.
 * |        |          |111 = CNT equal to CMPD in channel 3.
 * |[15]    |IFAEN2_3  |PWM_CH2 And PWM_CH3 Interrupt Flag Accumulator Enable
 * |        |          |0 = PWM_CH2 and PWM_CH3 interrupt flag accumulator disable.
 * |        |          |1 = PWM_CH2 and PWM_CH3 interrupt flag accumulator enable.
 * |[19:16] |IFCNT4_5  |PWM_CH4 And PWM_CH5 Interrupt Flag Counter
 * |        |          |The register sets the count number which defines how many times of PWM_CH4 and PWM_CH5 period occurs to set bit IFAIF4_5 to request the PWM period interrupt.
 * |        |          |PWM flag will be set in every IFCNT4_5[3:0] times of PWM period.
 * |[22:20] |IFSEL4_5  |PWM_CH4 And PWM_CH5 Interrupt Flag Accumulator Source Select
 * |        |          |000 = CNT equal to Zero in channel 4.
 * |        |          |001 = CNT equal to PERIOD in channel 4.
 * |        |          |010 = CNT equal to CMPU in channel 4.
 * |        |          |011 = CNT equal to CMPD in channel 4.
 * |        |          |100 = CNT equal to Zero in channel 5.
 * |        |          |101 = CNT equal to PERIOD in channel 5.
 * |        |          |110 = CNT equal to CMPU in channel 5.
 * |        |          |111 = CNT equal to CMPD in channel 5.
 * |[23]    |IFAEN4_5  |PWM_CH4 And PWM_CH5 Interrupt Flag Accumulator Enable
 * |        |          |0 = PWM_CH4 and PWM_CH5 interrupt flag accumulator disable.
 * |        |          |1 = PWM_CH4 and PWM_CH5 interrupt flag accumulator enable.
 * @var PWM_T::DACTRGEN
 * Offset: 0xF4  PWM Trigger DAC Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |ZTEn      |PWM Zero Point Trigger DAC Enable
 * |        |          |0 = PWM period point trigger DAC function Disabled.
 * |        |          |1 = PWM period point trigger DAC function Enabled.
 * |        |          |PWM can trigger EADC/DAC/DMA to start action when PWM counter down count to zero if this bit is set to 1.
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |[13:8]  |PTEn      |PWM Period Point Trigger DAC Enable
 * |        |          |0 = PWM period point trigger DAC function Disabled.
 * |        |          |1 = PWM period point trigger DAC function Enabled.
 * |        |          |PWM can trigger DAC to start action when PWM counter up count to (PERIODn+1) if this bit is set to 1.
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |[21:16] |CUTRGEn   |PWM Compare Up Count Point Trigger DAC Enable
 * |        |          |0 = PWM Compare Up point trigger DAC function Disabled.
 * |        |          |1 = PWM Compare Up point trigger DAC function Enabled.
 * |        |          |PWM can trigger DAC to start action when PWM counter up count to CMPDAT if this bit is set to 1.
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |Note1: This bit should keep at 0 when PWM counter operating in down counter type.
 * |        |          |Note2: In complementary mode, CUTRGE1, 3, 5 use as another CUTRGE for channel 0, 2, 4.
 * |[29:24] |CDTRGEn   |PWM Compare Down Count Point Trigger DAC Enable
 * |        |          |0 = PWM Compare Down count point trigger DAC function Disabled.
 * |        |          |1 = PWM Compare Down count point trigger DAC function Enabled.
 * |        |          |PWM can trigger DAC to start action when PWM counter down count to CMPDAT if this bit is set to 1.
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |Note1: This bit should keep at 0 when PWM counter operating in up counter type.
 * |        |          |Note2: In complementary mode, CDTRGE1, 3, 5 use as another CDTRGE for channel 0, 2, 4.
 * @var PWM_T::EADCTS0
 * Offset: 0xF8  PWM Trigger EADC Source Select Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |TRGSEL0   |PWM_CH0 Trigger EADC Source Select
 * |        |          |0000 = PWM_CH0 zero point.
 * |        |          |0001 = PWM_CH0 period point.
 * |        |          |0010 = PWM_CH0 zero or period point.
 * |        |          |0011 = PWM_CH0 up-count CMPDAT point.
 * |        |          |0100 = PWM_CH0 down-count CMPDAT point.
 * |        |          |0101 = PWM_CH1 zero point.
 * |        |          |0110 = PWM_CH1 period point.
